docs: Enhance the ingetstion lambda READme with a mermaid diagram
